Courses/7140/Projects/7140-project-2017.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-13 Mon 18:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Spring 2017 Project Work</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../Top/">CS 7140</a>
</div>
<div id="content">
<h1 class="title">Spring 2017 Project Work</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">1. Summer 2016</a></li>
<li><a href="#orgheadline6">2. Spring 2016</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> Summer 2016</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>This semester our project is on PDF editors.</li>

<li><a href="https://en.wikipedia.org/wiki/Portable_Document_Format#Technical_overview">https://en.wikipedia.org/wiki/Portable_Document_Format#Technical_overview</a>
   Required Reading.</li>

<li>FOSS PDF Tools/ Libraries: ICEpdf, iText, jPod, PDFBox, PDFClown,
pdfedit, PDFSharp, Poppler. Written in C++, C# or Java.  Web search for
links.  (Please help to make this list exhaustive.)</li>

<li>No solid comparison is available.  Web-search for "anecdotal"
comments.</li>

<li>I am <b>leaning toward</b> (i) iText, (ii) jPod, (iii) PDFbox, in that
order.  
<ol class="org-ol">
<li><code>sloccount</code> s have not been a serious factor.  But, relevant.</li>
<li>Quality of API docs mattered.</li>
<li>Popularity mattered.  Written in Java mattered.  Recent activity
mattered.</li>
<li>If you <b>know better</b>, post your opinion on Piazza.</li>
</ol></li>
</ol>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Expectations of our PDF-project</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Start with (or build afresh) a pdf-viewer-editor that can
<ol class="org-ol">
<li>Read "real world PDF documents" (that may slightly deviate from
the PDF-spec).</li>
<li>Split a PDF file into several, e.g., by page.</li>
<li>Extract text (Accuracy is important).</li>
<li>Edit Annotations.</li>
<li>Search for words and position a cursor.</li>
</ol></li>

<li>Write the software engineering documents as outlined in <a href="../../Projects/7140-project.html">Project
Work</a>.</li>

<li>Focus on the chosen library (one of iText, jPod, &#x2026;), and develop
assertions.  Revise the code applying good smells, and refactoring,
discussed in the course.</li>
</ol>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Non-Expectations</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Not expected: Edit a pdf file as if editing a MSWord document.
E.g., not expected to be available: replace one word with another,
insert/ delete a word</li>

<li>Not expected: Accept input from a stylus/pen.  Handwriting.
Freehand drawing.</li>

<li>Rendering &#x2013; leave it alone.</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> A Target</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><a href="http://www.tracker-software.com/product/pdf-xchange-editor">http://www.tracker-software.com/product/pdf-xchange-editor</a> Try this
freeware.  Can we duplicate the functionality of this? Even if we
cannot compete with its speed.</li>
</ol>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> Alternate Project Possibilities</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li><a href="http://sourceforge.net/projects/freemind/">http://sourceforge.net/projects/freemind/</a>.  Written in Java.
Here is wiki describing <a href="https://en.wikipedia.org/wiki/Mind_map">https://en.wikipedia.org/wiki/Mind_map</a>
programs, in general.</li>

<li><a href="https://sourceforge.net/projects/pdfedit/">https://sourceforge.net/projects/pdfedit/</a> Written in C++.  PDF
manipulation.  "Free editor for PDF documents. Complete editing of
PDF documents is possible with PDFedit. You can change raw pdf
objects (for advanced users) or use many gui functions.
Functionality can be easily extended using a scripting language
(ECMAScript)."</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> Spring 2016</h2>
<div class="outline-text-2" id="text-2">
<p>
A dir-sync program tries to make two directories become equal by
copying/deleting files from one dir to another.
</p>

<p>
<a href="http://sourceforge.net/projects/directorysync/">http://sourceforge.net/projects/directorysync/</a>
<code>sloccount src_dirsyncpro java=22445, nbproject xml=1310;</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2017-01-09
</div>
</body>
</html>
